INSERT INTO sql_expressions (id, "sql", source_name) VALUES
                                                         (10214, $r$"ДУЛ.Паспорт иностранного гражданина.Тип ДУЛ" = '31' and "ДУЛ.Паспорт иностранного гражданина.Дата выдачи" <  "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения"$r$, 'УСЛиК'),
                                                         (10218, $r$"ДУЛ.Вид на жительство.Тип ДУЛ" = '33' and "ДУЛ.Вид на жительство.Номер"  is NULL$r$, 'УСЛиК'),
                                                         (10215, $r$"ДУЛ.Паспорт иностранного гражданина.Тип ДУЛ" = '31' and "ДУЛ.Паспорт иностранного гражданина.Дата выдачи"> now()$r$, 'УСЛиК'),
                                                         (1098,  $r$"АДРЕС.Почтовый индекс" is not NULL and ("АДРЕС.Страна" in ('Российская Федерация', 'Россия', 'РФ') OR CAST("АДРЕС.Код страны" AS string) = '643') and not regexp_like(trim("АДРЕС.Почтовый индекс"), '^[0-9]{6}$')$r$, 'УСЛиК'),
                                                         (10125, $r$"ДУЛ.Военный билет.Тип ДУЛ" = '25' and "ДУЛ.Военный билет.Дата выдачи" < "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения"$r$, 'УСЛиК'),
                                                         (1192,  $r$1 = 1 and ("АДРЕС.Код страны"= 'unknown' or "АДРЕС.Код страны" IS NULL)$r$, 'УСЛиК'),
                                                         (10127, $r$now() < years_add("ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения", 14) and "ДУЛ.Паспорт РФ.Тип ДУЛ" = '21'$r$, 'УСЛиК'),
                                                         (10220, $r$"ДУЛ.Паспорт РФ.Тип ДУЛ" = '21' AND "ДУЛ.Паспорт РФ.Серия" LIKE '00%'$r$, 'УСЛиК'),
                                                         (1083,  $r$regexp_like("ОСНОВНЫЕ СВЕДЕНИЯ.Фамилия", ".*[^а-яА-ЯёЁa-zA-Z\\- .']") AND "ОСНОВНЫЕ СВЕДЕНИЯ.Фамилия" IS NOT NULL$r$, 'УСЛиК'),
                                                         (10207, $r$"ДУЛ.Загранпаспорт гражданина РФ.Тип ДУЛ" = '22' and "ДУЛ.Загранпаспорт гражданина РФ.Наименование типа ДУЛ" LIKE '%Заграничный%'  and "ДУЛ.Загранпаспорт гражданина РФ.Номер" is null$r$, 'УСЛиК'),
                                                         (1175,  $r$regexp_like("ОСНОВНЫЕ СВЕДЕНИЯ.ФИО одной строкой", ".*[^а-яА-ЯёЁa-zA-Z\\- .']") AND "ОСНОВНЫЕ СВЕДЕНИЯ.ФИО одной строкой" IS NOT NULL$r$, 'УСЛиК'),
                                                         (1124,  $r$"ДУЛ.Вид на жительство.Тип ДУЛ" = '33' and "ДУЛ.Вид на жительство.Дата начала срока действия" IS NULL$r$, 'УСЛиК'),
                                                         (1097,  $r$syslib.utf8_length("АДРЕС.Наименование города") > 30$r$, 'УСЛиК'),
                                                         (1084,  $r$"ОСНОВНЫЕ СВЕДЕНИЯ.Фамилия" is not null and regexp_like("ОСНОВНЫЕ СВЕДЕНИЯ.Фамилия", '^[\-\ ]|.*[\-\ ]$') and syslib.utf8_length("ОСНОВНЫЕ СВЕДЕНИЯ.Фамилия") > 1$r$, 'УСЛиК'),
                                                         (1134,  $r$"ДУЛ.Миграционная карта.Тип ДУЛ" = '39' and "ДУЛ.Миграционная карта.Дата начала срока действия" IS NULL$r$, 'УСЛиК'),
                                                         (1169,  $r$"АДРЕС.Страна" is not null and regexp_like("АДРЕС.Страна", '.*[^А-Яа-яЁё \-].*')$r$, 'УСЛиК'),
                                                         (10134, $r$"ДУЛ.Паспорт РФ.Тип ДУЛ" = '21' and ("ДУЛ.Паспорт РФ.Дата выдачи" < CAST('1997-10-01' as date) or "ДУЛ.Паспорт РФ.Дата выдачи" > now())$r$, 'УСЛиК'),
                                                         (1070,  $r$regexp_like("ОСНОВНЫЕ СВЕДЕНИЯ.Имя", '^[\-\ ]|.*[\-\ ]$') and syslib.utf8_length("ОСНОВНЫЕ СВЕДЕНИЯ.Имя") > 1$r$, 'УСЛиК'),
                                                         (10184, $r$"ДУЛ.Паспорт РФ.Тип ДУЛ" = '21' AND "ДУЛ.Паспорт РФ.Номер" IS NULL$r$, 'УСЛиК'),
                                                         (1118,  $r$"ДУЛ.Свидетельство о рождении.Тип ДУЛ" = '27' and "ДУЛ.Свидетельство о рождении.Дата выдачи" > now()$r$, 'УСЛиК'),
                                                         (1095,  $r$regexp_like("АДРЕС.Наименование города", '.*^[\-\ ].*')$r$, 'УСЛиК'),
                                                         (1117,  $r$"ДУЛ.Свидетельство о рождении.Тип ДУЛ" = '27' and "ДУЛ.Свидетельство о рождении.Дата выдачи" IS NULL$r$, 'УСЛиК'),
                                                         (10185, $r$now() > years_add("ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения", 100)$r$, 'УСЛиК'),
                                                         (1075,  $r$regexp_like("ОСНОВНЫЕ СВЕДЕНИЯ.Место рождения", '.*[- ]$')$r$, 'УСЛиК'),
                                                         (1135, $r$LENGTH(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', '')) = 11
                                                             and (
                                                                    (
                                                                        cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 1, 1) as int) * 9 +
                                                                        cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 2, 1) as int) * 8 +
                                                                        cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 3, 1) as int) * 7 +
                                                                        cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 4, 1) as int) * 6 +
                                                                        cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 5, 1) as int) * 5 +
                                                                        cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 6, 1) as int) * 4 +
                                                                        cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 7, 1) as int) * 3 +
                                                                        cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 8, 1) as int) * 2 +
                                                                        cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 9, 1) as int) * 1
                                                                        ) < 100
                                                                        and not (
                                                                        (
                                                                            cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 1, 1) as int) * 9 +
                                                                            cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 2, 1) as int) * 8 +
                                                                            cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 3, 1) as int) * 7 +
                                                                            cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 4, 1) as int) * 6 +
                                                                            cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 5, 1) as int) * 5 +
                                                                            cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 6, 1) as int) * 4 +
                                                                            cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 7, 1) as int) * 3 +
                                                                            cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 8, 1) as int) * 2 +
                                                                            cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 9, 1) as int) * 1
                                                                            ) = cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 10, 2) as int)
                                                                        )
                                                                    )$r$, 'УСЛиК'),
                                                         (1179,  $r$"ДУЛ.Паспорт РФ.Тип ДУЛ" = '21' and not REGEXP_LIKE("ДУЛ.Паспорт РФ.Кем выдан", '.*[а-яА-ЯёЁa-zA-Z]')$r$, 'УСЛиК'),
                                                         (1161,  $r$syslib.utf8_length("ОСНОВНЫЕ СВЕДЕНИЯ.Место рождения") < 4$r$, 'УСЛиК'),
                                                         (1116,  $r$"ДУЛ.Свидетельство о рождении.Тип ДУЛ" = '27' and not regexp_like("ДУЛ.Свидетельство о рождении.Номер", '^[0-9]{6}$')$r$, 'УСЛиК'),
                                                         (10102, $r$"ДУЛ.Паспорт иностранного гражданина.Тип ДУЛ" = '31' AND "ДУЛ.Паспорт иностранного гражданина.Номер" IS NULL$r$, 'УСЛиК'),
                                                         (1066,  $r$"ОСНОВНЫЕ СВЕДЕНИЯ.Имя" IS NULL$r$, 'УСЛиК'),
                                                         (1068,  $r$regexp_like("ОСНОВНЫЕ СВЕДЕНИЯ.Имя", ".*[^а-яА-ЯёЁa-zA-Z\\- .']") AND "ОСНОВНЫЕ СВЕДЕНИЯ.Имя" IS NOT NULL$r$, 'УСЛиК'),
                                                         (10103, $r$"ДУЛ.Паспорт иностранного гражданина.Тип ДУЛ" = '31' AND "ДУЛ.Паспорт иностранного гражданина.Дата выдачи" IS NULL$r$, 'УСЛиК'),
                                                         (1096,  $r$regexp_like("АДРЕС.Наименование города", '.*[- ]$')$r$, 'УСЛиК'),
                                                         (1076,  $r$regexp_like("ОСНОВНЫЕ СВЕДЕНИЯ.Отчество", '.*[a-zA-Z]+.*') and regexp_like("ОСНОВНЫЕ СВЕДЕНИЯ.Отчество", '.*[а-яА-ЯеЁ]+.*')$r$, 'УСЛиК'),
                                                         (1104,  $r$"ДУЛ.Паспорт РФ.Тип ДУЛ" = '21' and not regexp_like(syslib.utf8_substr("ДУЛ.Паспорт РФ.Код подразделения", 1, length("ДУЛ.Паспорт РФ.Код подразделения")), '^[0-9]{3}-?[0-9]{3}$') and syslib.utf8_substr("ДУЛ.Паспорт РФ.Код подразделения", 1, length("ДУЛ.Паспорт РФ.Код подразделения")) is not null$r$, 'УСЛиК'),
                                                         (10289, $r$"ДУЛ.Дипломатический паспорт гражданина РФ.Тип ДУЛ" = '22' and "ДУЛ.Дипломатический паспорт гражданина РФ.Наименование типа ДУЛ" LIKE '%Дипломатический%' and not regexp_like("ДУЛ.Дипломатический паспорт гражданина РФ.Серия", '^[0-9]{2}$')$r$, 'УСЛиК'),
                                                         (1146,  $r$"ОСНОВНЫЕ СВЕДЕНИЯ.Тип клиента" != '9' AND "КОНТАКТ.Телефон.Номер телефона" IS NULL$r$, 'УСЛиК'),
                                                         (1115,  $r$"ДУЛ.Свидетельство о рождении.Тип ДУЛ" = '27' and "ДУЛ.Свидетельство о рождении.Номер" IS NULL$r$, 'УСЛиК'),
                                                         (1087,  $r$"ОСНОВНЫЕ СВЕДЕНИЯ.ФИО одной строкой" is null$r$, 'УСЛиК'),
                                                         (1193,  $r$"АДРЕС.Код страны" is not null and not regexp_like(cast("АДРЕС.Код страны" as string), '^[0-9]{3}$')$r$, 'УСЛиК'),
                                                         (10189, $r$regexp_like("АДРЕС. Улица", '.*[- ]$')$r$, 'УСЛиК'),
                                                         (1085,  $r$("ГРАЖДАНСТВО.Идентификатор системы-источника" IS NULL OR "ГРАЖДАНСТВО.Идентификатор системы-источника" != 258) AND ("ГРАЖДАНСТВО.Страна" IS NULL OR "ГРАЖДАНСТВО.Страна" = 'unknown')$r$, 'УСЛиК'),
                                                         (1166,  $r$regexp_like("АДРЕС.Населенный пункт", '.*[a-zA-Z]+.*') and regexp_like("АДРЕС.Населенный пункт", '.*[а-яА-ЯёЁ]+.*')$r$, 'УСЛиК'),
                                                         (10188, $r$regexp_like("АДРЕС. Улица", '.*^[\-\ ].*')$r$, 'УСЛиК'),
                                                         (10257, $r$"ДУЛ.Патент на работу.Тип ДУЛ" = '49' AND "ДУЛ.Патент на работу.Дата выдачи" < "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения"$r$, 'УСЛиК'),
                                                         (10251, $r$"ДУЛ.Разрешение на временное проживание.Тип ДУЛ" = '34' and "ДУЛ.Разрешение на временное проживание.Дата окончания срока действия"< "ДУЛ.Разрешение на временное проживание.Дата выдачи"$r$, 'УСЛиК'),
                                                         (10243, $r$"ДУЛ.Виза.Тип ДУЛ" in ('3', '40') and "ДУЛ.Виза.Дата окончания срока действия"< now()$r$, 'УСЛиК'),
                                                         (1065,  $r$"ОСНОВНЫЕ СВЕДЕНИЯ.Дата смерти" > now() or "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения" > "ОСНОВНЫЕ СВЕДЕНИЯ.Дата смерти"$r$, 'УСЛиК'),
                                                         (10104, $r$"ДУЛ.Временное удостоверение личности гражданина РФ.Тип ДУЛ" = '26' and "ДУЛ.Временное удостоверение личности гражданина РФ.Номер" is null$r$, 'УСЛиК'),
                                                         (10191, $r$"ДУЛ.Миграционная карта.Тип ДУЛ" = '39' AND "ДУЛ.Миграционная карта.Серия" IS NULL$r$, 'УСЛиК'),
                                                         (1162,  $r$regexp_like("ОСНОВНЫЕ СВЕДЕНИЯ.Отчество", ".*[^а-яА-ЯёЁa-zA-Z\\- .']") AND "ОСНОВНЫЕ СВЕДЕНИЯ.Отчество" IS NOT NULL$r$, 'УСЛиК'),
                                                         (1099,  $r$"АДРЕС.Почтовый индекс" is not NULL and "АДРЕС.Почтовый индекс" in ('111111', '222222', '333333', '444444', '555555', '666666', '777777', '888888', '999999', '000000', '123456', '234567', '345678', '567890')$r$, 'УСЛиК'),
                                                         (1119,  $r$"ДУЛ.Свидетельство о рождении.Тип ДУЛ" = '27' and "ДУЛ.Свидетельство о рождении.Кем выдан" IS NULL$r$, 'УСЛиК'),
                                                         (10245, $r$"ДУЛ.Разрешение на временное проживание.Тип ДУЛ" = '34' and "ДУЛ.Разрешение на временное проживание.Номер"  is NULL$r$, 'УСЛиК'),
                                                         (10256, $r$"ДУЛ.Патент на работу.Тип ДУЛ" = '49' AND "ДУЛ.Патент на работу.Дата выдачи"  > now()$r$, 'УСЛиК'),
                                                         (10247, $r$"ДУЛ.Разрешение на временное проживание.Тип ДУЛ" = '34' and "ДУЛ.Разрешение на временное проживание.Дата выдачи" > now()$r$, 'УСЛиК'),
                                                         (1079,  $r$"ОСНОВНЫЕ СВЕДЕНИЯ.Пол" IS NULL or "ОСНОВНЫЕ СВЕДЕНИЯ.Пол" not in ('M', 'F')$r$, 'УСЛиК'),
                                                         (10107, $r$"ДУЛ.Военный билет.Тип ДУЛ" = '25' and "ДУЛ.Военный билет.Кем выдан" is null$r$, 'УСЛиК'),
                                                         (10109, $r$"ДУЛ.Дипломатический паспорт гражданина РФ.Тип ДУЛ" = '22' and "ДУЛ.Дипломатический паспорт гражданина РФ.Наименование типа ДУЛ" LIKE '%Дипломатический%' and "ДУЛ.Дипломатический паспорт гражданина РФ.Кем выдан" is null$r$, 'УСЛиК'),
                                                         (1078,  $r$regexp_like("ОСНОВНЫЕ СВЕДЕНИЯ.Отчество", '^[\-\ ]|.*[\-\ ]$') and syslib.utf8_length("ОСНОВНЫЕ СВЕДЕНИЯ.Отчество") > 1$r$, 'УСЛиК'),
                                                         (1113,  $r$"ДУЛ.Свидетельство о рождении.Тип ДУЛ" = '27' and "ДУЛ.Свидетельство о рождении.Серия" IS NULL$r$, 'УСЛиК'),
                                                         (1164,  $r$"АДРЕС.Страна" IS NULL$r$, 'УСЛиК'),
                                                         (10108, $r$"ДУЛ.Дипломатический паспорт гражданина РФ.Тип ДУЛ" = '22' and "ДУЛ.Дипломатический паспорт гражданина РФ.Наименование типа ДУЛ" LIKE '%Дипломатический%' and "ДУЛ.Дипломатический паспорт гражданина РФ.Номер" is null$r$, 'УСЛиК'),
                                                         (10274, $r$"ДУЛ.Разрешение на временное проживание.Тип ДУЛ" = '34' and "ДУЛ.Разрешение на временное проживание.Дата окончания срока действия" < now()$r$, 'УСЛиК'),
                                                         (10106, $r$"ДУЛ.Военный билет.Тип ДУЛ" = '25' and "ДУЛ.Военный билет.Номер" is null$r$, 'УСЛиК'),
                                                         (1069,  $r$regexp_like("ОСНОВНЫЕ СВЕДЕНИЯ.Имя", '.*[a-zA-Z]+.*') and regexp_like("ОСНОВНЫЕ СВЕДЕНИЯ.Имя", '.*[а-яА-ЯеЁ]+.*')$r$, 'УСЛиК'),
                                                         (10272, $r$"ДУЛ.Миграционная карта.Тип ДУЛ" = '39' and "ДУЛ.Миграционная карта.Дата начала срока действия"< "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения"$r$, 'УСЛиК'),
                                                         (10135, $r$"ДУЛ.Паспорт РФ.Тип ДУЛ" = '21' and "ДУЛ.Паспорт РФ.Дата выдачи" < years_add( "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения", 14) and "ДУЛ.Паспорт РФ.Дата выдачи" < now() and "ДУЛ.Паспорт РФ.Дата выдачи" >= CAST('1997-10-01' as date)$r$, 'УСЛиК'),
                                                         (1158,  $r$"ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения" >= current_date() or "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения" = "ДУЛ.Паспорт РФ.Дата выдачи"$r$, 'УСЛиК'),
                                                         (10136, $r$"ДУЛ.Свидетельство о рождении.Тип ДУЛ" = '27' and "ДУЛ.Свидетельство о рождении.Дата выдачи" < "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения"$r$, 'УСЛиК'),
                                                         (10133, $r$"ДУЛ.Паспорт РФ.Тип ДУЛ" = '21' and "ДУЛ.Паспорт РФ.Дата выдачи" <= "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения"$r$, 'УСЛиК'),
                                                         (10148, $r$("ДУЛ.Паспорт РФ.Тип ДУЛ" = '21' AND (UPPER("ГРАЖДАНСТВО.Страна") NOT IN ('RUS', 'РОССИЙСКАЯ ФЕДЕРАЦИЯ', 'РОССИЯ', 'РФ') AND "ГРАЖДАНСТВО.Страна"  NOT LIKE '%643%')) OR
("ДУЛ.Дипломатический паспорт гражданина РФ.Тип ДУЛ" = '22' AND (UPPER("ГРАЖДАНСТВО.Страна") NOT IN ('RUS', 'РОССИЙСКАЯ ФЕДЕРАЦИЯ', 'РОССИЯ', 'РФ') AND "ГРАЖДАНСТВО.Страна"  NOT LIKE '%643%'))  OR
("ДУЛ.Загранпаспорт гражданина РФ.Тип ДУЛ" = '22' AND (UPPER("ГРАЖДАНСТВО.Страна") NOT IN ('RUS', 'РОССИЙСКАЯ ФЕДЕРАЦИЯ', 'РОССИЯ', 'РФ') AND "ГРАЖДАНСТВО.Страна"  NOT LIKE '%643%')) OR
("ДУЛ.Удостоверение личности военнослужащего.Тип ДУЛ" = '24' AND (UPPER("ГРАЖДАНСТВО.Страна") NOT IN ('RUS', 'РОССИЙСКАЯ ФЕДЕРАЦИЯ', 'РОССИЯ', 'РФ') AND "ГРАЖДАНСТВО.Страна"  NOT LIKE '%643%')) OR
("ДУЛ.Военный билет.Тип ДУЛ" = '25' AND (UPPER("ГРАЖДАНСТВО.Страна") NOT IN ('RUS', 'РОССИЙСКАЯ ФЕДЕРАЦИЯ', 'РОССИЯ', 'РФ') AND"ГРАЖДАНСТВО.Страна"  NOT LIKE '%643%')) OR
("ДУЛ.Временное удостоверение личности гражданина РФ.Тип ДУЛ" = '26' AND (UPPER("ГРАЖДАНСТВО.Страна") NOT IN ('RUS', 'РОССИЙСКАЯ ФЕДЕРАЦИЯ', 'РОССИЯ', 'РФ') AND "ГРАЖДАНСТВО.Страна"  NOT LIKE '%643%')) OR
("ДУЛ.Свидетельство о рождении.Тип ДУЛ" = '27' AND (UPPER("ГРАЖДАНСТВО.Страна") NOT IN ('RUS', 'РОССИЙСКАЯ ФЕДЕРАЦИЯ', 'РОССИЯ', 'РФ') AND "ГРАЖДАНСТВО.Страна"  NOT LIKE '%643%'))  OR
("ДУЛ.Служебный паспорт гражданина РФ.Тип ДУЛ" = '0' AND (UPPER("ГРАЖДАНСТВО.Страна") NOT IN ('RUS', 'РОССИЙСКАЯ ФЕДЕРАЦИЯ', 'РОССИЯ', 'РФ') AND "ГРАЖДАНСТВО.Страна"  NOT LIKE '%643%'))  OR
("ДУЛ.Паспорт иностранного гражданина.Тип ДУЛ" = '31' AND (UPPER("ГРАЖДАНСТВО.Страна") IN ('RUS', 'РОССИЙСКАЯ ФЕДЕРАЦИЯ', 'РОССИЯ', 'РФ') OR "ГРАЖДАНСТВО.Страна" LIKE '%643%'))  OR
("ДУЛ.Вид на жительство.Тип ДУЛ" = '33' AND (UPPER("ГРАЖДАНСТВО.Страна") IN ('RUS', 'РОССИЙСКАЯ ФЕДЕРАЦИЯ', 'РОССИЯ', 'РФ') OR "ГРАЖДАНСТВО.Страна" LIKE '%643%'))  OR
("ДУЛ.Миграционная карта.Тип ДУЛ" = '39' AND (UPPER("ГРАЖДАНСТВО.Страна") IN ('RUS', 'РОССИЙСКАЯ ФЕДЕРАЦИЯ', 'РОССИЯ', 'РФ') OR "ГРАЖДАНСТВО.Страна" LIKE '%643%'))  OR
("ДУЛ.Виза.Тип ДУЛ" in ('3', '40') AND (UPPER("ГРАЖДАНСТВО.Страна") IN ('RUS', 'РОССИЙСКАЯ ФЕДЕРАЦИЯ', 'РОССИЯ', 'РФ') OR "ГРАЖДАНСТВО.Страна" LIKE '%643%'))$r$, 'УСЛиК'),
  (10290, $r$"ДУЛ.Дипломатический паспорт гражданина РФ.Тип ДУЛ" = '22' and "ДУЛ.Дипломатический паспорт гражданина РФ.Наименование типа ДУЛ" LIKE '%Дипломатический%' and "ДУЛ.Дипломатический паспорт гражданина РФ.Дата окончания срока действия" is null$r$, 'УСЛиК'),
  (10137, $r$"ДУЛ.Служебный паспорт гражданина РФ.Тип ДУЛ" = '0' and "ДУЛ.Служебный паспорт гражданина РФ.Дата выдачи" < "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения"$r$, 'УСЛиК'),
  (1148,  $r$"ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения" IS NULL$r$, 'УСЛиК'),
  (1086,  $r$"ИНН.Номер свидетельства" IS NOT NULL and not regexp_like("ИНН.Номер свидетельства", '^[0-9]{12}$') and "ИНН.Страна"= 'RUS'$r$, 'УСЛиК'),
  (10253, $r$"ДУЛ.Патент на работу.Тип ДУЛ" = '49' AND "ДУЛ.Патент на работу.Номер" IS NULL$r$, 'УСЛиК'),
  (1074,  $r$regexp_like("ОСНОВНЫЕ СВЕДЕНИЯ.Место рождения", '^[0-9-,.\(\)\/ ]')$r$, 'УСЛиК'),
  (1132,  $r$"ДУЛ.Миграционная карта.Тип ДУЛ" = '39' AND "ДУЛ.Миграционная карта.Номер" IS NULL$r$, 'УСЛиК'),
  (10276, $r$"ДУЛ.Загранпаспорт гражданина РФ.Тип ДУЛ" = '22' and "ДУЛ.Загранпаспорт гражданина РФ.Номер" is NOT NULL and not regexp_like("ДУЛ.Загранпаспорт гражданина РФ.Номер", '^[0-9]{7}$')$r$, 'УСЛиК'),
  (10244, $r$"ДУЛ.Паспорт РФ.Дата выдачи" is not null and "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения" is not null and "ДУЛ.Паспорт РФ.Дата выдачи" < CAST('2021-01-11' as date)
  and (
  (extract(year FROM AGE(current_date, "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения")) >= 20
    AND current_date > "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения" + INTERVAL '20 years' + INTERVAL '90 days'
    AND "ДУЛ.Паспорт РФ.Дата выдачи" < "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения" + INTERVAL '20 years')
  OR
  (extract(year FROM AGE(current_date, "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения")) >= 45
    AND current_date > "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения" + INTERVAL '45 years' + INTERVAL '90 days'
    AND "ДУЛ.Паспорт РФ.Дата выдачи" < "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения" + INTERVAL '45 years'))$r$, 'УСЛиК'),
  (10209, $r$"ДУЛ.Загранпаспорт гражданина РФ.Тип ДУЛ" = '22' and "ДУЛ.Загранпаспорт гражданина РФ.Наименование типа ДУЛ" LIKE '%Заграничный%'  and "ДУЛ.Загранпаспорт гражданина РФ.Серия" is null$r$, 'УСЛиК'),
  (10138, $r$"ДУЛ.Удостоверение личности военнослужащего.Тип ДУЛ" = '24' and "ДУЛ.Удостоверение личности военнослужащего.Дата выдачи" <  "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения"$r$, 'УСЛиК'),
  (1072,  $r$"ОСНОВНЫЕ СВЕДЕНИЯ.Место рождения" IS NULL$r$, 'УСЛиК'),
  (1092,  $r$"ИНН.Номер свидетельства" IS NOT NULL and SUBSTRING("ИНН.Номер свидетельства", 1, 2) in ('00')$r$, 'УСЛиК'),
  (1080,  $r$"ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС" IS NOT NULL and syslib.utf8_length(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', '')) <> 11$r$, 'УСЛиК'),
  (1107,  $r$"ДУЛ.Паспорт РФ.Тип ДУЛ" = '21' and (not regexp_like("ДУЛ.Паспорт РФ.Номер", '^[0-9]{6}$') OR CAST("ДУЛ.Паспорт РФ.Номер"AS INT) NOT BETWEEN 101 AND 999999)$r$, 'УСЛиК'),
  (10291, $r$"ДУЛ.Дипломатический паспорт гражданина РФ.Тип ДУЛ" = '22' and "ДУЛ.Дипломатический паспорт гражданина РФ.Наименование типа ДУЛ" LIKE '%Дипломатический%' and "ДУЛ.Дипломатический паспорт гражданина РФ.Дата окончания срока действия" < "ДУЛ.Дипломатический паспорт гражданина РФ.Дата выдачи"$r$, 'УСЛиК'),
  (1090,  $r$regexp_like("ОСНОВНЫЕ СВЕДЕНИЯ.ФИО одной строкой", '^[\-\ ]|.*[\-\ ]$') and syslib.utf8_length("ОСНОВНЫЕ СВЕДЕНИЯ.ФИО одной строкой") > 1$r$, 'УСЛиК'),
  (10080, $r$"ДУЛ.Дипломатический паспорт гражданина РФ.Тип ДУЛ" = '22' and "ДУЛ.Дипломатический паспорт гражданина РФ.Наименование типа ДУЛ" LIKE '%Дипломатический%'  and "ДУЛ.Дипломатический паспорт гражданина РФ.Дата выдачи" is null$r$, 'УСЛиК'),
  (1108,  $r$"ДУЛ.Паспорт РФ.Тип ДУЛ" = '21' AND "ДУЛ.Паспорт РФ.Кем выдан" IS NULL$r$, 'УСЛиК'),
  (1109,  $r$"ДУЛ.Паспорт РФ.Тип ДУЛ" = '21' AND "ДУЛ.Паспорт РФ.Серия" IS NULL$r$, 'УСЛиК'),
  (1093,  $r$"ИНН.Номер свидетельства" IS NOT NULL and not (syslib.utf8_length("ИНН.Номер свидетельства") = 12 and substring("ИНН.Номер свидетельства", - 1, 1) = substring(cast((cast(substring("ИНН.Номер свидетельства", 1, 1) as int) * 3 + cast(substring("ИНН.Номер свидетельства", 2, 1) as int) * 7 + cast(substring("ИНН.Номер свидетельства", 3, 1) as int) * 2 + cast(substring("ИНН.Номер свидетельства", 4, 1) as int) * 4 + cast(substring("ИНН.Номер свидетельства", 5, 1) as int) * 10 + cast(substring("ИНН.Номер свидетельства", 6, 1) as int) * 3 + cast(substring("ИНН.Номер свидетельства", 7, 1) as int) * 5 + cast(substring("ИНН.Номер свидетельства", 8, 1) as int) * 9 + cast(substring("ИНН.Номер свидетельства", 9, 1) as int) * 4 + cast(substring("ИНН.Номер свидетельства", 10, 1) as int) * 6 + cast(substring("ИНН.Номер свидетельства", 11, 1) as int) * 8) % 11 as string), - 1, 1) and substring("ИНН.Номер свидетельства", - 2, 1) = substring(cast((cast(substring("ИНН.Номер свидетельства", 1, 1) as int) * 7 + cast(substring("ИНН.Номер свидетельства", 2, 1) as int) * 2 + cast(substring("ИНН.Номер свидетельства", 3, 1) as int) * 4 + cast(substring("ИНН.Номер свидетельства", 4, 1) as int) * 10 + cast(substring("ИНН.Номер свидетельства", 5, 1) as int) * 3 + cast(substring("ИНН.Номер свидетельства", 6, 1) as int) * 5 + cast(substring("ИНН.Номер свидетельства", 7, 1) as int) * 9 + cast(substring("ИНН.Номер свидетельства", 8, 1) as int) * 4 + cast(substring("ИНН.Номер свидетельства", 9, 1) as int) * 6 + cast(substring("ИНН.Номер свидетельства", 10, 1) as int) * 8) % 11 as string), - 1, 1))$r$, 'УСЛиК'),
  (1106,  $r$"ДУЛ.Паспорт РФ.Тип ДУЛ" = '21' and syslib.utf8_substr("ДУЛ.Паспорт РФ.Код подразделения", 1, length("ДУЛ.Паспорт РФ.Код подразделения")) is null$r$, 'УСЛиК'),
  (10139, $r$"ДУЛ.Служебный паспорт гражданина РФ.Тип ДУЛ" = '0' and "ДУЛ.Служебный паспорт гражданина РФ.Дата выдачи" > now()$r$, 'УСЛиК'),
  (1165,  $r$"ДУЛ.Паспорт РФ.Тип ДУЛ" = '21' AND LENGTH("ДУЛ.Паспорт РФ.Кем выдан") < 5$r$, 'УСЛиК'),
  (1105,  $r$"ДУЛ.Паспорт РФ.Тип ДУЛ" = '21' and regexp_like("ДУЛ.Паспорт РФ.Код подразделения", '^[0-9]{2}[6-9]-[0-9]{3}$')$r$, 'УСЛиК'),
  (10067, $r$"ОСНОВНЫЕ СВЕДЕНИЯ.Отчество" is null and "ОСНОВНЫЕ СВЕДЕНИЯ.Признак отсутствия отчества" = 0$r$, 'УСЛиК'),
  (10287, $r$"ДУЛ.Временное удостоверение личности гражданина РФ.Тип ДУЛ" = '26' and "ДУЛ.Временное удостоверение личности гражданина РФ.Дата окончания срока действия" < now()$r$, 'УСЛиК'),
  (10083, $r$"ДУЛ.Загранпаспорт гражданина РФ.Тип ДУЛ" = '22' and "ДУЛ.Загранпаспорт гражданина РФ.Наименование типа ДУЛ" LIKE '%Заграничный%' and "ДУЛ.Загранпаспорт гражданина РФ.Дата выдачи" is null$r$, 'УСЛиК'),
  (1103,  $r$"ДУЛ.Паспорт РФ.Тип ДУЛ" = '21' and "ДУЛ.Паспорт РФ.Дата выдачи" IS NULL$r$, 'УСЛиК'),
  (1088,  $r$"ОСНОВНЫЕ СВЕДЕНИЯ.ФИО одной строкой" regexp '.*[a-zA-Z]+.*' AND "ОСНОВНЫЕ СВЕДЕНИЯ.ФИО одной строкой" regexp '.*[а-яА-ЯеЁ]+.*'$r$, 'УСЛиК'),
  (10077, $r$"ДУЛ.Военный билет.Тип ДУЛ" = '25' and "ДУЛ.Военный билет.Дата выдачи" is null$r$, 'УСЛиК'),
  (10074, $r$"ДУЛ.Временное удостоверение личности гражданина РФ.Тип ДУЛ" = '26' and "ДУЛ.Временное удостоверение личности гражданина РФ.Дата выдачи" is null$r$, 'УСЛиК'),
  (10078, $r$"ДУЛ.Военный билет.Тип ДУЛ" = '25' and "ДУЛ.Военный билет.Дата выдачи" > now()$r$, 'УСЛиК'),
  (10299, $r$"ДУЛ.Служебный паспорт гражданина РФ.Тип ДУЛ" = '0' and "ДУЛ.Служебный паспорт гражданина РФ.Дата окончания срока действия"< "ДУЛ.Служебный паспорт гражданина РФ.Дата выдачи"$r$, 'УСЛиК'),
  (10094, $r$"ДУЛ.Вид на жительство.Тип ДУЛ" = '33' and "ДУЛ.Вид на жительство.Дата выдачи" >= now()$r$, 'УСЛиК'),
  (10089, $r$"ДУЛ.Служебный паспорт гражданина РФ.Тип ДУЛ" = '0' and "ДУЛ.Служебный паспорт гражданина РФ.Дата выдачи" is null$r$, 'УСЛиК'),
  (1094,  $r$(UPPER("АДРЕС.Страна") IN ('RUS', 'РОССИЙСКАЯ ФЕДЕРАЦИЯ', 'РОССИЯ', 'РФ') or "АДРЕС.Страна" LIKE '%643%')
    AND regexp_like("АДРЕС.Наименование города", '^[^А-Яа-яЁё]|.*[^А-Яа-яЁё0-9 \-.].*')$r$, 'УСЛиК'),
    (10122, $r$"ДУЛ.Виза.Тип ДУЛ" in ('3', '40') and ("ДУЛ.Виза.Дата начала срока действия" < "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения" or "ДУЛ.Виза.Дата начала срока действия" > now())$r$, 'УСЛиК'),
    (1112,  $r$"ДУЛ.Паспорт РФ.Тип ДУЛ" = '21' AND NOT regexp_like("ДУЛ.Паспорт РФ.Серия", '^[0-9]{4}$') AND NOT regexp_like("ДУЛ.Паспорт РФ.Серия", '^[0-9]{2}[\ -]?[0-9]{2}$')$r$, 'УСЛиК'),
    (1073,  $r$regexp_like("ОСНОВНЫЕ СВЕДЕНИЯ.Место рождения", '.*[a-zA-Z]+.*') and regexp_like("ОСНОВНЫЕ СВЕДЕНИЯ.Место рождения", '.*[а-яА-ЯеЁ]+.*')$r$, 'УСЛиК'),
    (1114,  $r$"ДУЛ.Свидетельство о рождении.Тип ДУЛ" = '27' and not (regexp_like("ДУЛ.Свидетельство о рождении.Серия", '^[IVX]+-[А-Я]{2}$') or regexp_like("ДУЛ.Свидетельство о рождении.Серия", '^[IVX]+ [А-Я]{2}$'))$r$, 'УСЛиК'),
    (1125,  $r$"ДУЛ.Вид на жительство.Тип ДУЛ" = '33' and "ДУЛ.Вид на жительство.Дата начала срока действия" IS NOT NULL and ("ДУЛ.Вид на жительство.Дата начала срока действия" > now() or "ДУЛ.Вид на жительство.Дата начала срока действия" > "ДУЛ.Вид на жительство.Дата окончания срока действия")$r$, 'УСЛиК'),
    (10326, $r$"ДУЛ.Загранпаспорт гражданина РФ.Тип ДУЛ" = '22' and "ДУЛ.Загранпаспорт гражданина РФ.Наименование типа ДУЛ" LIKE '%Заграничный%'  and "ДУЛ.Загранпаспорт гражданина РФ.Дата окончания срока действия"  < "ДУЛ.Загранпаспорт гражданина РФ.Дата выдачи"$r$, 'УСЛиК'),
    (10147, $r$"ДУЛ.Миграционная карта.Тип ДУЛ" = '39' and regexp_like("ДУЛ.Миграционная карта.Номер", '.*[^0-9].*') AND "ДУЛ.Миграционная карта.Номер" IS NOT NULL$r$, 'УСЛиК'),
    (1120,  $r$"ДУЛ.Свидетельство о рождении.Тип ДУЛ" = '27' and syslib.utf8_length("ДУЛ.Свидетельство о рождении.Кем выдан") < 5$r$, 'УСЛиК'),
    (10328, $r$"ОСНОВНЫЕ СВЕДЕНИЯ.Фамилия" IS NULL and "ОСНОВНЫЕ СВЕДЕНИЯ.Код страны рождения" in ('AFG', 'ERI', 'IND', 'ISL', 'MMR', 'IDN')$r$, 'УСЛиК'),
    (10255, $r$"ДУЛ.Патент на работу.Тип ДУЛ" = '49'  AND "ДУЛ.Патент на работу.Дата выдачи" IS NULL$r$, 'УСЛиК'),
    (1178,  $r$"КОНТАКТ.Телефон.Номер телефона" is not null
    AND (NOT REGEXP_LIKE("КОНТАКТ.Телефон.Номер телефона", '^(\\+?7|8)')
    AND (NOT LENGTH(REGEXP_REPLACE("КОНТАКТ.Телефон.Номер телефона", '[^\\d]', '')) BETWEEN 7 AND 15
    OR NOT REGEXP_LIKE("КОНТАКТ.Телефон.Номер телефона",'^[0-9\\+\\-\\(\\) ]+$')))$r$, 'УСЛиК'),
    (10229, $r$"ДУЛ.Удостоверение личности военнослужащего.Тип ДУЛ" = '24' and "ДУЛ.Удостоверение личности военнослужащего.Номер" is NOT NULL and not regexp_like("ДУЛ.Удостоверение личности военнослужащего.Номер", '^[0-9]{6,7}$')$r$, 'УСЛиК'),
    (10242, $r$"ДУЛ.Виза.Тип ДУЛ" in ('3', '40') and "ДУЛ.Виза.Дата окончания срока действия" IS NULL$r$, 'УСЛиК'),
    (10086, $r$"ДУЛ.Удостоверение личности военнослужащего.Тип ДУЛ" = '24' and "ДУЛ.Удостоверение личности военнослужащего.Дата выдачи" is null$r$, 'УСЛиК'),
    (1196,  $r$"КОНТАКТ.Телефон.Номер телефона" IS NOT NULL
    AND (("КОНТАКТ.Телефон.Номер телефона" REGEXP  '^(\\+?7|8)')
    AND NOT (
    "КОНТАКТ.Телефон.Номер телефона" REGEXP  '^(\\+?7|8) ?[0-9]{10}$'
    OR "КОНТАКТ.Телефон.Номер телефона" REGEXP  '^(\\+?7|8) ?[(]{1}[0-9]{3}[)]{1} ?[0-9]{7}$'
    OR "КОНТАКТ.Телефон.Номер телефона" REGEXP  '^(\\+?7|8) ?[(]{1}[0-9]{3}[)]{1} ?[0-9]{3} [0-9]{2} [0-9]{2}$'
    OR "КОНТАКТ.Телефон.Номер телефона" REGEXP  '^(\\+?7|8) ?[(]{1}[0-9]{3}[)]{1} ?[0-9]{3}-[0-9]{2}-[0-9]{2}$'
    OR "КОНТАКТ.Телефон.Номер телефона" REGEXP  '^(\\+?7|8) ?[(]{1}[0-9]{4}[)]{1} ?[0-9]{6}$'
    OR "КОНТАКТ.Телефон.Номер телефона"  REGEXP  '^(\\+?7|8) ?[(]{1}[0-9]{4}[)]{1} ?[0-9]{2} [0-9]{2} [0-9]{2}$'
    OR "КОНТАКТ.Телефон.Номер телефона" REGEXP  '^(\\+?7|8) ?[(]{1}[0-9]{4}[)]{1} ?[0-9]{2}-[0-9]{2}-[0-9]{2}$'
    ))$r$, 'УСЛиК'),
    (10129, $r$"ДУЛ.Дипломатический паспорт гражданина РФ.Тип ДУЛ" = '22'
    and "ДУЛ.Дипломатический паспорт гражданина РФ.Наименование типа ДУЛ" LIKE '%Дипломатический%'
    and"ДУЛ.Дипломатический паспорт гражданина РФ.Дата выдачи" < "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения"$r$, 'УСЛиК'),
    (10230, $r$"ДУЛ.Удостоверение личности военнослужащего.Тип ДУЛ" = '24' and "ДУЛ.Удостоверение личности военнослужащего.Кем выдан" is null$r$, 'УСЛиК'),
    (10228, $r$"ДУЛ.Удостоверение личности военнослужащего.Тип ДУЛ" = '24' and "ДУЛ.Удостоверение личности военнослужащего.Номер" is null$r$, 'УСЛиК'),
    (10123, $r$"ДУЛ.Вид на жительство.Тип ДУЛ" = '33' and "ДУЛ.Вид на жительство.Дата выдачи" < "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения"$r$, 'УСЛиК'),
    (1144,  $r$"АДРЕС.Наименование региона" not in ('Город Санкт-Петербург', 'Город Москва', 'Город Севастополь',  'Москва',  'Севастополь', 'Санкт-Петербург') and "АДРЕС.Наименование города" IS NULL and "АДРЕС.Населенный пункт" IS NULL and ("АДРЕС.Наименование типа адреса" != 'Иной' OR "АДРЕС.Наименование типа адреса" IS NULL)$r$, 'УСЛиК'),
    (10208, $r$"ДУЛ.Загранпаспорт гражданина РФ.Тип ДУЛ" = '22' and "ДУЛ.Загранпаспорт гражданина РФ.Наименование типа ДУЛ" LIKE '%Заграничный%'  and "ДУЛ.Загранпаспорт гражданина РФ.Кем выдан" is null$r$, 'УСЛиК'),
    (10213, $r$regexp_like("АДРЕС.Улица", '^[0-9]*$') AND "АДРЕС.Улица" IS NOT NULL$r$, 'УСЛиК'),
    (10212, $r$"ДУЛ.Военный билет.Тип ДУЛ" = '25' and "ДУЛ.Военный билет.Номер" is NOT NULL and not regexp_like("ДУЛ.Военный билет.Номер", '^[0-9]{7}$')$r$, 'УСЛиК'),
    (10224, $r$"ДУЛ.Загранпаспорт гражданина РФ.Тип ДУЛ" = '22' and "ДУЛ.Загранпаспорт гражданина РФ.Наименование типа ДУЛ" LIKE '%Заграничный%'  and "ДУЛ.Загранпаспорт гражданина РФ.Дата окончания срока действия" is null$r$, 'УСЛиК'),
    (1126,  $r$"ДУЛ.Вид на жительство.Тип ДУЛ" = '33'
    and "ДУЛ.Вид на жительство.Дата начала срока действия" < CAST('2019-11-01' as date)
    and "ДУЛ.Вид на жительство.Дата окончания срока действия" is null$r$, 'УСЛиК'),
    (10219, $r$"ДУЛ.Вид на жительство.Тип ДУЛ" = '33' and "ДУЛ.Вид на жительство.Номер"  IS NOT NULL and not regexp_like("ДУЛ.Вид на жительство.Номер", '^[0-9]{7}$')$r$, 'УСЛиК'),
    (10292, $r$"ДУЛ.Дипломатический паспорт гражданина РФ.Тип ДУЛ" = '22' and "ДУЛ.Дипломатический паспорт гражданина РФ.Наименование типа ДУЛ" LIKE '%Дипломатический%' and "ДУЛ.Дипломатический паспорт гражданина РФ.Дата окончания срока действия" < now()$r$, 'УСЛиК'),
    (10241, $r$"ДУЛ.Виза.Тип ДУЛ" in ('3', '40') and "ДУЛ.Виза.Дата начала срока действия" IS NULL$r$, 'УСЛиК'),
    (10075, $r$"ДУЛ.Временное удостоверение личности гражданина РФ.Тип ДУЛ" = '26' and "ДУЛ.Временное удостоверение личности гражданина РФ.Дата выдачи" > now()$r$, 'УСЛиК'),
    (10246, $r$"ДУЛ.Разрешение на временное проживание.Тип ДУЛ" = '34' and "ДУЛ.Разрешение на временное проживание.Дата выдачи"  is NULL$r$, 'УСЛиК'),
    (10236, $r$"ДУЛ.Виза.Тип ДУЛ" in ('3', '40') and "ДУЛ.Виза.Номер" IS NULL$r$, 'УСЛиК'),
    (10250, $r$"ДУЛ.Разрешение на временное проживание.Тип ДУЛ" = '34' and "ДУЛ.Разрешение на временное проживание.Дата окончания срока действия" is null$r$, 'УСЛиК'),
    (10258, $r$"ДУЛ.Патент на работу.Тип ДУЛ" = '49' AND "ДУЛ.Патент на работу.Дата окончания срока действия" IS NULL$r$, 'УСЛиК'),
    (10254, $r$"ДУЛ.Патент на работу.Тип ДУЛ" = '49'  AND "ДУЛ.Патент на работу.Кем выдано" IS NULL$r$, 'УСЛиК'),
    (10126, $r$"ДУЛ.Временное удостоверение личности гражданина РФ.Тип ДУЛ" = '26' and "ДУЛ.Временное удостоверение личности гражданина РФ.Дата выдачи" < years_add("ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения", 14)$r$, 'УСЛиК'),
    (10279, $r$"ДУЛ.Дипломатический паспорт гражданина РФ.Тип ДУЛ" = '22' and "ДУЛ.Дипломатический паспорт гражданина РФ.Номер" is NOT NULL and not regexp_like("ДУЛ.Дипломатический паспорт гражданина РФ.Номер", '^[0-9]{7}$')$r$, 'УСЛиК'),
    (10273, $r$"ДУЛ.Патент на работу.Тип ДУЛ" = '49' AND "ДУЛ.Патент на работу.Дата окончания срока действия"  < now()$r$, 'УСЛиК'),
    (10288, $r$"ДУЛ.Дипломатический паспорт гражданина РФ.Тип ДУЛ" = '22' and "ДУЛ.Дипломатический паспорт гражданина РФ.Наименование типа ДУЛ" LIKE '%Дипломатический%' and "ДУЛ.Дипломатический паспорт гражданина РФ.Серия" is null$r$, 'УСЛиК'),
    (1081,  $r$"ОСНОВНЫЕ СВЕДЕНИЯ.Фамилия" is not NULL and "ОСНОВНЫЕ СВЕДЕНИЯ.Фамилия" regexp '.*[a-zA-Z]+.*' AND "ОСНОВНЫЕ СВЕДЕНИЯ.Фамилия" regexp '.*[а-яА-ЯеЁ]+.*'$r$, 'УСЛиК'),
    (10087, $r$"ДУЛ.Удостоверение личности военнослужащего.Тип ДУЛ" = '24' and "ДУЛ.Удостоверение личности военнослужащего.Дата выдачи"> now()$r$, 'УСЛиК'),
    (10281, $r$("ДУЛ.Миграционная карта.Тип ДУЛ" = '39'
    AND "ДУЛ.Миграционная карта.Дата окончания срока действия" < now()
    AND "ДУЛ.Патент на работу.Тип ДУЛ" = '49'
    AND "ДУЛ.Патент на работу.Дата окончания срока действия" < now())
    OR
    ("ДУЛ.Миграционная карта.Тип ДУЛ" = '39'
    AND "ДУЛ.Миграционная карта.Дата окончания срока действия" < now()
    AND "ДУЛ.Патент на работу.Тип ДУЛ" IS NULL)$r$, 'УСЛиК'),
  (1137,  $r$"ДУЛ.Миграционная карта.Тип ДУЛ" = '39' and "ДУЛ.Миграционная карта.Дата окончания срока действия" IS NULL$r$, 'УСЛиК'),
  (10101, $r$"ДУЛ.Паспорт иностранного гражданина.Тип ДУЛ" = '31' AND "ДУЛ.Паспорт иностранного гражданина.Кем выдан" IS NULL$r$, 'УСЛиК'),
  (10296, $r$"ДУЛ.Служебный паспорт гражданина РФ.Тип ДУЛ" = '0' and  "ДУЛ.Служебный паспорт гражданина РФ.Серия" is null$r$, 'УСЛиК'),
  (1091,  $r$("ОСНОВНЫЕ СВЕДЕНИЯ.Фамилия" is null and syslib.utf8_lower("ОСНОВНЫЕ СВЕДЕНИЯ.ФИО одной строкой") <> TRIM(CONCAT(COALESCE(syslib.utf8_lower("ОСНОВНЫЕ СВЕДЕНИЯ.Имя"), ''), COALESCE(' ', ''), COALESCE(syslib.utf8_lower("ОСНОВНЫЕ СВЕДЕНИЯ.Отчество"), ''))))
OR
("ОСНОВНЫЕ СВЕДЕНИЯ.Фамилия" is null and "ОСНОВНЫЕ СВЕДЕНИЯ.Отчество" is null and syslib.utf8_lower("ОСНОВНЫЕ СВЕДЕНИЯ.ФИО одной строкой") <> syslib.utf8_lower("ОСНОВНЫЕ СВЕДЕНИЯ.Имя"))
OR
(syslib.utf8_lower("ОСНОВНЫЕ СВЕДЕНИЯ.ФИО одной строкой") <> TRIM(CONCAT(COALESCE(syslib.utf8_lower("ОСНОВНЫЕ СВЕДЕНИЯ.Фамилия"), ''), COALESCE(' ', ''), COALESCE(syslib.utf8_lower("ОСНОВНЫЕ СВЕДЕНИЯ.Имя"), ''), COALESCE(' ', ''), COALESCE(syslib.utf8_lower("ОСНОВНЫЕ СВЕДЕНИЯ.Отчество"), ''))))$r$, 'УСЛиК'),
  (10259, $r$"ДУЛ.Патент на работу.Тип ДУЛ" = '49' AND "ДУЛ.Патент на работу.Дата окончания срока действия" > years_add( "ДУЛ.Патент на работу.Дата выдачи", 1)  AND "ДУЛ.Патент на работу.Дата окончания срока действия"  is not NULL$r$, 'УСЛиК'),
  (10196, $r$regexp_like("АДРЕС.Населенный пункт", '.*[a-zA-Z]+.*') AND (UPPER("АДРЕС.Страна") IN ('RUS', 'РОССИЙСКАЯ ФЕДЕРАЦИЯ', 'РОССИЯ', 'РФ') AND "АДРЕС.Страна" LIKE '%643%')$r$, 'УСЛиК'),
  (1174, $r$"КОНТАКТ.Почта.Электронный адрес (email)" is not null and NOT regexp_like("КОНТАКТ.Почта.Электронный адрес (email)", '^[a-zA-Zа-яА-ЯёЁ0-9._+-]+@[a-zA-Zа-яА-ЯёЁ0-9.-]+\\.[a-zA-Zа-яА-ЯёЁ]{2,}$') OR regexp_like("КОНТАКТ.Почта.Электронный адрес (email)", '\\.\\.') OR regexp_like("КОНТАКТ.Почта.Электронный адрес (email)", '(^\\.|\\.$|@\\.)')$r$, 'УСЛиК'),
  (10294, $r$"ДУЛ.Служебный паспорт гражданина РФ.Тип ДУЛ" = '0'
and "ДУЛ.Служебный паспорт гражданина РФ.Номер"  is NOT NULL
and not regexp_like("ДУЛ.Служебный паспорт гражданина РФ.Номер", '^[0-9]{7}$')$r$, 'УСЛиК'),
  (10303, $r$"ДУЛ.Виза.Тип ДУЛ" in ('3', '40') and "ДУЛ.Виза.Дата окончания срока действия" < "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения"$r$, 'УСЛиК'),
  (10260, $r$"ДУЛ.Разрешение на временное проживание.Тип ДУЛ" = '34' and "ДУЛ.Разрешение на временное проживание.Дата выдачи"< "ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения"$r$, 'УСЛиК'),
  (10285, $r$"ДУЛ.Временное удостоверение личности гражданина РФ.Тип ДУЛ" = '26' and "ДУЛ.Временное удостоверение личности гражданина РФ.Дата окончания срока действия" is null$r$, 'УСЛиК'),
  (1127,  $r$"ДУЛ.Вид на жительство.Тип ДУЛ" = '33' and "ДУЛ.Вид на жительство.Дата окончания срока действия" IS NOT NULL and "ДУЛ.Вид на жительство.Дата окончания срока действия" < "ДУЛ.Вид на жительство.Дата начала срока действия"$r$, 'УСЛиК'),
  (10240, $r$"ДУЛ.Вид на жительство.Тип ДУЛ" = '33' and "ДУЛ.Вид на жительство.Дата окончания срока действия" IS NOT NULL and "ДУЛ.Вид на жительство.Дата окончания срока действия" < now()$r$, 'УСЛиК'),
  (10302, $r$"ДУЛ.Виза.Тип ДУЛ" in ('3', '40') and "ДУЛ.Паспорт иностранного гражданина.Наименование типа ДУЛ" LIKE '%Виза%' and syslib.utf8_length("ДУЛ.Виза.Номер") <> 7$r$, 'УСЛиК'),
  (1182,  $r$LENGTH(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', '')) = 11   AND (   (( cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 1, 1) as int) * 9  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 2, 1) as int) * 8  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 3, 1) as int) * 7  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 4, 1) as int) * 6  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 5, 1) as int) * 5  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 6, 1) as int) * 4  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 7, 1) as int) * 3  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 8, 1) as int) * 2  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 9, 1) as int) * 1) > 100  AND ( cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 1, 1) as int) * 9  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 2, 1) as int) * 8  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 3, 1) as int) * 7  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 4, 1) as int) * 6  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 5, 1) as int) * 5  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 6, 1) as int) * 4  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 7, 1) as int) * 3  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 8, 1) as int) * 2  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 9, 1) as int) * 1) % 101 = 100  AND NOT cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 10, 2) as int) = 00)    OR ((cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 1, 1) as int) * 9  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 2, 1) as int) * 8  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 3, 1) as int) * 7  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 4, 1) as int) * 6  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 5, 1) as int) * 5  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 6, 1) as int) * 4  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 7, 1) as int) * 3  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 8, 1) as int) * 2  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 9, 1) as int) * 1) > 302  AND  (cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 1, 1) as int) * 9  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 2, 1) as int) * 8  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 3, 1) as int) * 7  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 4, 1) as int) * 6  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 5, 1) as int) * 5  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 6, 1) as int) * 4  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 7, 1) as int) * 3  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 8, 1) as int) * 2  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 9, 1) as int) * 1) % 101 != cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 10, 2) as int))  OR (   (cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 1, 1) as int) * 9  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 2, 1) as int) * 8  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 3, 1) as int) * 7  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 4, 1) as int) * 6  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 5, 1) as int) * 5  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 6, 1) as int) * 4  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 7, 1) as int) * 3  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 8, 1) as int) * 2  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 9, 1) as int) * 1) < 201  and (cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 1, 1) as int) * 9  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 2, 1) as int) * 8  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 3, 1) as int) * 7  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 4, 1) as int) * 6  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 5, 1) as int) * 5  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 6, 1) as int) * 4  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 7, 1) as int) * 3  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 8, 1) as int) * 2  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 9, 1) as int) * 1) > 101  AND  (cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 1, 1) as int) * 9  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 2, 1) as int) * 8  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 3, 1) as int) * 7  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 4, 1) as int) * 6  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 5, 1) as int) * 5  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 6, 1) as int) * 4  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 7, 1) as int) * 3  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 8, 1) as int) * 2  + cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 9, 1) as int) * 1) - 101 != cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 10, 2) as int))  or   decode((cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 1, 1) as int) * 9  +  cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 2, 1) as int) * 8  +  cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 3, 1) as int) * 7  +  cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 4, 1) as int) * 6  +  cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 5, 1) as int) * 5  +  cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 6, 1) as int) * 4  +  cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 7, 1) as int) * 3  +  cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 8, 1) as int) * 2  +  cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 9, 1) as int) * 1) % 101,100,0, (cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 1, 1) as int) * 9  +  cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 2, 1) as int) * 8  +  cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 3, 1) as int) * 7  +  cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 4, 1) as int) * 6  +  cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 5, 1) as int) * 5  +  cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 6, 1) as int) * 4  +  cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 7, 1) as int) * 3  +  cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 8, 1) as int) * 2  +  cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 9, 1) as int) * 1) % 101) != cast(substring(replace(replace("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", '-', ''), ' ', ''), 10, 2) as int) )$r$, 'УСЛиК'),
  (10295, $r$"ДУЛ.Служебный паспорт гражданина РФ.Тип ДУЛ" = '0' and "ДУЛ.Служебный паспорт гражданина РФ.Кем выдан" is null$r$, 'УСЛиК'),
  (1194,  $r$(UPPER("АДРЕС.Страна") IN ('RUS', 'РОССИЙСКАЯ ФЕДЕРАЦИЯ', 'РОССИЯ', 'РФ') OR "АДРЕС.Страна" LIKE '%643%')
AND "АДРЕС.Район" IS NOT NULL
AND regexp_like("АДРЕС.Район", "^[^А-Яа-яЁё]|.*[^А-Яа-яЁё0-9 \-№.].*")$r$, 'УСЛиК'),
  (10081, $r$"ДУЛ.Дипломатический паспорт гражданина РФ.Тип ДУЛ" = '22'
and "ДУЛ.Дипломатический паспорт гражданина РФ.Наименование типа ДУЛ" LIKE '%Дипломатический%'and "ДУЛ.Дипломатический паспорт гражданина РФ.Дата выдачи" > now()$r$, 'УСЛиК'),
  (10282, $r$"ДУЛ.Загранпаспорт гражданина РФ.Тип ДУЛ" = '22' and "ДУЛ.Загранпаспорт гражданина РФ.Наименование типа ДУЛ" LIKE '%Заграничный%'  and  "ДУЛ.Загранпаспорт гражданина РФ.Дата выдачи" IS NOT NULL and "ДУЛ.Загранпаспорт гражданина РФ.Дата выдачи"  > "ДУЛ.Загранпаспорт гражданина РФ.Дата окончания срока действия"$r$, 'УСЛиК')

ON CONFLICT (id) DO UPDATE
  SET "sql" = EXCLUDED."sql",
      source_name = EXCLUDED.source_name;